# 參閱16-14頁

from ultralytics import YOLO # 引用 YOLO 模組

coco_names = ["人", "腳踏車", "汽車", "機車", "飛機", "巴士", "火車",
 "卡車", "船", "交通號誌", "消防栓", "停止標誌", "停車計時器", 
"長椅", "鳥", "貓", "狗", "馬", "羊", "牛", "大象", "熊", "斑馬", 
"長頸鹿", "背包", "雨傘", "手提包", "領帶", "行李箱", "飛盤", 
"滑雪板", "滑雪板", "運動球", "風箏", "棒球棒", "棒球手套", "滑板", 
"衝浪板", "網球拍", "瓶子", "酒杯", "杯子", "叉","刀", "湯匙", "碗", 
"香蕉", "蘋果", "三明治", "柳橙", "花椰菜", "胡蘿蔔", "熱狗", "披薩", 
"甜甜圈", "蛋糕", "椅子", "沙發", "盆栽", "床", "餐桌", "馬桶", 
"電視螢幕", "筆記型電腦", "滑鼠", "遙控器","鍵盤", "手機", "微波爐", 
"烤箱", "烤麵包機", "水槽", "冰箱", "書", "時鐘", "花瓶","剪刀", 
"泰迪熊", "吹風機", "牙刷"]

model = YOLO("yolo12n.pt")   # 載入模型檔，建立「模型」物件
image = 'img/vehicles.jpg'   # 僅讀取一張影像

results = model(image, classes=[2,5,6,7])
for r in results:
    for b in r.boxes:
        name = coco_names[int(b.cls[0])]
        conf = round(float(b.conf[0]), 2)
        label = name + ":" + str(conf)
        print(label,end=' ')